{
    "title": "Raspberry-Lemon Bread Pudding",
    "level": "Easy",
    "yield": "6 servings",
    "cooking time": "2 hr 15 min",
    "ingredients": [
        "4 cups 1/2-inch crustless cubes of sourdough bread",
        "4 tablespoons unsalted butter",
        "1/2 cup plus 1 tablespoon sugar",
        "4 large eggs",
        "2 teaspoons lightly packed finely grated lemon zest (from about 2 large lemons)",
        "1/2 teaspoon pure vanilla extract",
        "Pinch fine salt",
        "1 1/2 cups half-and-half",
        "1 1/2 cups raspberries"
    ],
    "steps": [
        "Position an oven rack in the center of the oven, and preheat to 375 degrees F. Spread the bread on a baking sheet, and bake until crispy and dried out, about 10 minutes. Let cool completely.",
        "Meanwhile, melt the butter in a small skillet over medium heat, and cook until it starts to bubble and foam, about 5 minutes. Continue cooking, stirring constantly, until the foam subsides and brown specks start to appear, 1 to 2 minutes. Transfer the browned butter to a small bowl, scraping the brown bits from the bottom of the skillet, and let cool slightly.",
        "Whisk together 1/2 cup of the sugar, the eggs, lemon zest, vanilla and salt in a large bowl until the mixture is pale and thick. Whisk in the half-and-half and 3 tablespoons of the browned butter until combined. Stir in the bread and raspberries, and let the mixture sit for 30 minutes, stirring occasionally.",
        "Brush the inside of six 8-ounce ramekins with the remaining browned butter, and coat with the remaining 1 tablespoon sugar, tapping out any excess. Divide the bread pudding mixture evenly among the ramekins. Set the ramekins in a large roasting pan, and carefully fill the pan with 1/2 inch of hot water. Bake until the custard is just set and the tops are lightly golden brown in spots, about 45 minutes, rotating the pan once halfway through. Let cool for 10 minutes before serving."
    ],
    "cook note": "Never leave a child unattended in the kitchen. Limit the child to tasks that are safe and age-appropriate.",
    "categories": [
        "Bread Pudding",
        "Fruit",
        "Raspberry Recipes",
        "Lemon",
        "Dessert",
        "Kid-Friendly"
    ]
}