{
    "0": {
        "title": "A Nice Cup of Tea",
        "level": "Very Easy",
        "yield": "Not specified",
        "cooking time": "15 minutes",
        "ingredients": [
            "32 fl oz (1 L) hot water",
            "3 - 5 measures of loose tea leaves or 3 - 5 tea bags",
            "Sweetener, such as sugar or honey, to taste",
            "Milk or lemon juice to taste"
        ],
        "steps": [
            "Pour freshly-drawn water into a tea kettle, and heat it to your desired temperature. An electric kettle is fast and convenient.",
            "Pour some hot tap water into your teapot and let stand for about several seconds to a minute to pre-warm it. Alternately, you can swish some of the hotter boiling water from your kettle around in the teapot for a few seconds. Pour out this water before adding the tea to the teapot.",
            "If using loose tea, place it into an infuser, then into the teapot. If using teabags, place them into the teapot.",
            "When the water reaches the preferred temperature, pour it from the tea kettle into the teapot. As you pour, try to avoid pouring directly onto the tea (especially important for green and white teas) to avoid scalding the leaves.",
            "Allow the tea to infuse quietly (i.e. do not stir the teapot or \"dunk the teabag\"). Agitating the tea releases more of the bitter compounds and degrades the taste. Watch the time to avoid over-infusion, and remove the infuser or tea bag when the time is up.",
            "Pour tea into your cup(s). Add sweetener and milk or lemon to taste."
        ],
        "cook note": [
            "You can also prepare a single cup of tea at once by placing a single measure of tea directly into the serving cup.",
            "Commonly one-half to one tea measure (or rounded teaspoon if you do not have a tea measure) is added per desired cup of tea. Some people add an extra measure \"for the pot\" (e.g., if 4 cups of tea are desired, 5 measures of tea would be used. It really is a matter of personal preference.)",
            "Remember that the tannins in tea stain, so it is advisable to pour the tea over a non-staining surface, wipe up any spills quickly, and not leave tea standing in a teapot for long periods of time.",
            "Never combine milk and lemon in the same cup of tea or the milk will curdle into lumps.",
            "If you are using an infuser, be sure it is closed tightly so the tea does not spill into the pot. Rinse the tea-filled infuser briefly under cool tap water to wash away tiny flakes that would otherwise drift into the teapot.",
            "If using a filter basket infuser, do not overfill the basket (refer to the instructions that came with your basket). The brief rinse is usually not necessary unless the basket's mesh is quite porous.",
            "Simply dropping loose tea into the teapot is also an option, though you may want to strain the tea as you pour it into the cups.",
            "See the page on tea for additional considerations."
        ],
        "categories": [
            "Beverage recipes",
            "Cookbook",
            "Ingredients",
            "Recipes",
            "Very Easy recipes",
            "Recipes",
            "Irish recipes",
            "English recipes",
            "Tea recipes",
            "Gluten-free recipes",
            "Vegetarian recipes",
            "Easy recipes",
            "Beverage recipes",
            "Lemon recipes",
            "Recipes with images",
            "Recipes without servings"
        ]
    },
    "1": {
        "title": "Baked Penne",
        "level": "Easy",
        "yield": "4",
        "cooking time": "1 hour",
        "ingredients": [
            "1 cup (125  g/4.4  oz) uncooked penne pasta",
            "1 cup (300  g/11  oz) ricotta cheese",
            "4 eggs, separated and brought to room temperature",
            "1/4 cup (1/5 stick/125  g/4.4  oz) unsalted butter, melted",
            "1/8 tsp cream of tartar",
            "1 pinch salt",
            "1/4 tsp freshly-ground black pepper",
            "1 tsp minced garlic",
            "1 tbsp flat-leaf parsley, finely chopped",
            "1/5 cup (60  g/2.1  oz) grated mozzarella cheese",
            "1 1/5 cups (400  g/14  oz) tomato paste",
            "4 leaves fresh basil"
        ],
        "steps": [
            "Preheat the oven to 375 degrees F (191  degrees C).",
            "In a gallon of salted, boiling water, cook pasta until al dente. Drain and rinse with cold water. Set aside.",
            "Combine ricotta, egg yolks, butter, salt, pepper, garlic, parsley, and tomato paste. Fold in cooked pasta. Set aside.",
            "In a spotlessly clean metal bowl, beat egg whites to stiff peaks with cream of tartar. Gently fold into pasta mixture.",
            "Pour into a parchment-lined high-sided roasting pan. Sprinkle with mozzarella cheese and cover with aluminum foil. Bake in the center of the oven for 15 minutes.",
            "Remove foil and lower temperature to 350 degrees F (177  degrees C). Bake for another 30 minutes or until browned and bubbly on top.",
            "Place serving portions onto plates and garnish with basil. Serve warm."
        ],
        "cook note": [
            "No notes available"
        ],
        "categories": [
            "Pasta recipes",
            "Cookbook",
            "Ingredients",
            "Recipes",
            "Easy recipes",
            "Recipes",
            "Baked recipes",
            "Garlic recipes",
            "Italian recipes",
            "Pasta recipes",
            "Egg recipes",
            "Butter recipes"
        ]
    }
}